#### [`repos-partners`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-Q5UwNambGRQhXbEr" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/bb000709-e67f-4295-afc8-4f495d12ea97/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-Q5UwNambGRQhXbEr

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.github_team.repospartners_cdktfteamcdktf_13186D35: Reading...
github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5: Refreshing state... [id=cdktf-provider-mongodbatlas]
github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063: Refreshing state... [id=cdktf-provider-mongodbatlas-go]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE: Refreshing state... [id=cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_USERNAME]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4: Refreshing state... [id=cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748: Refreshing state... [id=cdktf-provider-mongodbatlas:GH_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D: Refreshing state... [id=cdktf-provider-mongodbatlas:NPM_TOKEN]
github_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA: Refreshing state... [id=398580582]
github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82: Refreshing state... [id=BPR_kwDOI2liXc4CAYbG]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_USERNAME]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B: Refreshing state... [id=cdktf-provider-mongodbatlas:NUGET_API_KEY]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828: Refreshing state... [id=cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN]
github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F: Refreshing state... [id=cdktf-provider-mongodbatlas:automerge]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_PASSWORD]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_PASSWORD]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225: Refreshing state... [id=cdktf-provider-mongodbatlas-go:automerge]
github_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE: Refreshing state... [id=398580580]
data.github_team.repospartners_cdktfteamcdktf_13186D35: Read complete after 6s [id=6602018]
github_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas-go]
github_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_file.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_codeowners_15BC90B3 will be created
  + resource "github_repository_file" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_codeowners_15BC90B3" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-mongodbatlas-go"
      + sha                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-Q5UwNambGRQhXbEr%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.3.7%0Aon linux_amd64%0AInitializing plugins and modules...%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Reading...%0Agithub_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5: Refreshing state... [id=cdktf-provider-mongodbatlas]%0Agithub_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063: Refreshing state... [id=cdktf-provider-mongodbatlas-go]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE: Refreshing state... [id=cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_USERNAME]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4: Refreshing state... [id=cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748: Refreshing state... [id=cdktf-provider-mongodbatlas:GH_TOKEN]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D: Refreshing state... [id=cdktf-provider-mongodbatlas:NPM_TOKEN]%0Agithub_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA: Refreshing state... [id=398580582]%0Agithub_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82: Refreshing state... [id=BPR_kwDOI2liXc4CAYbG]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_USERNAME]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B: Refreshing state... [id=cdktf-provider-mongodbatlas:NUGET_API_KEY]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828: Refreshing state... [id=cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN]%0Agithub_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F: Refreshing state... [id=cdktf-provider-mongodbatlas:automerge]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]%0Agithub_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225: Refreshing state... [id=cdktf-provider-mongodbatlas-go:automerge]%0Agithub_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE: Refreshing state... [id=398580580]%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Read complete after 6s [id=6602018]%0Agithub_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas-go]%0Agithub_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # github_repository_file.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_codeowners_15BC90B3 will be created%0A  + resource "github_repository_file" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_codeowners_15BC90B3" {%0A      + branch              = "main"%0A      + commit_author       = (known after apply)%0A      + commit_email        = (known after apply)%0A      + commit_message      = (known after apply)%0A      + commit_sha          = (known after apply)%0A      + content             = <<-EOT%0A            # These owners will be the default owners for everything in %0A            # the repo. Unless a later match takes precedence, %0A            # they will be requested for review when someone opens a %0A            # pull request.%0A            *       @cdktf/tf-cdk-team%0A        EOT%0A      + file                = ".github/CODEOWNERS"%0A      + id                  = (known after apply)%0A      + overwrite_on_create = false%0A      + repository          = "cdktf-provider-mongodbatlas-go"%0A      + sha                 = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-Q5UwNambGRQhXbEr%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.3.7%0Aon linux_amd64%0AInitializing plugins and modules...%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Reading...%0Agithub_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5: Refreshing state... [id=cdktf-provider-mongodbatlas]%0Agithub_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063: Refreshing state... [id=cdktf-provider-mongodbatlas-go]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE: Refreshing state... [id=cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_USERNAME]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4: Refreshing state... [id=cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748: Refreshing state... [id=cdktf-provider-mongodbatlas:GH_TOKEN]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D: Refreshing state... [id=cdktf-provider-mongodbatlas:NPM_TOKEN]%0Agithub_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA: Refreshing state... [id=398580582]%0Agithub_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82: Refreshing state... [id=BPR_kwDOI2liXc4CAYbG]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_USERNAME]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B: Refreshing state... [id=cdktf-provider-mongodbatlas:NUGET_API_KEY]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828: Refreshing state... [id=cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN]%0Agithub_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F: Refreshing state... [id=cdktf-provider-mongodbatlas:automerge]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]%0Agithub_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225: Refreshing state... [id=cdktf-provider-mongodbatlas-go:automerge]%0Agithub_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE: Refreshing state... [id=398580580]%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Read complete after 6s [id=6602018]%0Agithub_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas-go]%0Agithub_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # github_repository_file.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_codeowners_15BC90B3 will be created%0A  + resource "github_repository_file" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_codeowners_15BC90B3" {%0A      + branch              = "main"%0A      + commit_author       = (known after apply)%0A      + commit_email        = (known after apply)%0A      + commit_message      = (known after apply)%0A      + commit_sha          = (known after apply)%0A      + content             = <<-EOT%0A            # These owners will be the default owners for everything in %0A            # the repo. Unless a later match takes precedence, %0A            # they will be requested for review when someone opens a %0A            # pull request.%0A            *       @cdktf/tf-cdk-team%0A        EOT%0A      + file                = ".github/CODEOWNERS"%0A      + id                  = (known after apply)%0A      + overwrite_on_create = false%0A      + repository          = "cdktf-provider-mongodbatlas-go"%0A      + sha                 = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

*Pusher: @mutahhir, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*